Public Attributes | List of all members
API_AnalyticalSurface Struct Reference
Analytical Model
Describes the Structural Analytical Model Surface of a Structural Analytical Model Surface Member. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
API_AnalyticalSurfaceType  | surfaceType
Type of the surface's geometry.
API_AnalyticalPlaneSurface  | planeSurface
Describes the geometry of the surface by a plane. Only used when the surfaceType is API_AnalyticalSurface_PlaneType.
API_AnalyticalCylinderSurface  | cylinderSurface
Describes the geometry of the surface by a cylinder. Only used when the surfaceType is API_AnalyticalSurface_CylinderType.
Detailed Description
Describes the Structural Analytical Model Surface of a Structural Analytical Model Surface Member.
Since
Archicad 24
Member Data Documentation
◆ cylinderSurface
 API_AnalyticalSurface::cylinderSurface
Describes the geometry of the surface by a cylinder. Only used when the surfaceType is API_AnalyticalSurface_CylinderType.
◆ planeSurface
 API_AnalyticalSurface::planeSurface
Describes the geometry of the surface by a plane. Only used when the surfaceType is API_AnalyticalSurface_PlaneType.
◆ surfaceType
 API_AnalyticalSurface::surfaceType
Type of the surface's geometry.